/// <summary>
/// UIManager 를 통해서 로드하려는 UI의 Prefab(프리팹) 파일 이름을 넣어주세요.
/// </summary>
public enum UIList
{
    //===========================================================
    // 2D Popup UI
    //===========================================================
    SCENE_POPUP,


    OKCancelPopup,
    SampleUI,



    ExitUI,


    MAX_SCENE_POPUP,
    //===========================================================

    //===========================================================
    // 2D Panel UI
    //===========================================================
    SCENE_PANEL,

    ShootingGameUI,

    IngameUI,
    LobbyUI,



    MAX_SCENE_PANEL,
    //===========================================================
}